In [18]:
import match
import pandas as pd
import seaborn as sns

In [19]:
titanic_data = pd.read_csv('./../data/titanic_data.csv')

In [16]:
titanic_data.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

### Clean Data
- Make sure to convert data to be all numeric (one-hot encode categorical data)
- Remove data that is unstructured/unique to each row
- Remove any rows that contain null values

In [20]:
titanic_numerical = titanic_data[[ 'age', 'sibsp', 'parch', 'fare']]
titanic_categorical = titanic_data[['pclass', 'sex', 'embarked']]
titanic_categorical = pd.get_dummies(titanic_categorical)
titanic_categorical['first_class?'] = titanic_categorical.pclass.apply(lambda x: 1 if x == 1 else 0)

In [21]:
titanic_clean = pd.concat([titanic_numerical, titanic_categorical[['first_class?', 'sex_male', 'embarked_C', 'embarked_Q']]], axis=1)
titanic_clean.dropna(inplace=True)

In [22]:
titanic_clean['first_class?'].value_counts()

0    528
1    186
Name: first_class?, dtype: int64

In [23]:
# match the data
titanic_final = match.match(titanic_clean, 'first_class?', is_csv, output_csv='./../data/titanic_matched.csv')

<class 'pandas.core.frame.DataFrame'>
Generating Logistic Regression Model...
Model Generated
Matching Propesensity Scores...
Matching Complete

In [24]:
titanic_final

,age,sibsp,parch,fare,first_class?,sex_male,embarked_C,embarked_Q,SCORE
1,38.0,1,0,71.2833,1,0,1,0,0.997262
3,35.0,1,0,53.1000,1,0,0,0,0.897860
6,54.0,0,0,51.8625,1,1,0,0,0.995329
11,58.0,0,0,26.5500,1,0,0,0,0.848962
23,28.0,0,0,35.5000,1,1,0,0,0.754749
...,...,...,...,...,...,...,...,...,...
865,42.0,0,0,13.0000,0,0,0,0,0.196114
873,47.0,0,0,9.0000,0,1,0,0,0.163837
874,28.0,1,0,24.0000,0,0,1,0,0.122599
880,25.0,0,1,26.0000,0,0,0,0,0.187454
886,27.0,0,0,13.0000,0,1,0,0,0.085788